local command = { "админлист", "Список администрации" };

command.printlist = function (rmsg, right)
	local smiles = { '&#128513;', '&#128514;', '&#128515;', '&#128516;', '&#128517;', '&#128519;', '&#128520;', '&#128518;',
		'&#128521;', '&#128523;', '&#128522;', '&#128524;', '&#128525;', '&#128527;', '&#128529;', '&#128526;', '&#128528;', '&#128530;', '&#128531;',
		'&#128532;', '&#128535;', '&#128533;', '&#128536;', '&#128534;', '&#128537;', '&#128538;', '&#128540;', '&#128539;', '&#128541;', '&#128543;',
		'&#128544;', '&#128542;', '&#128545;', '&#128547;', '&#128548;', '&#128549;', '&#128546;', '&#128550;', '&#128551;', '&#128553;', '&#128552;',
		'&#128554;', '&#128555;', '&#128556;', '&#128557;', '&#128558;', '&#128561;', '&#128560;', '&#128559;', '&#128562;', '&#128565;', '&#128567;',
		'&#128563;', '&#128566;', '&#128569;', '&#128572;', '&#128571;', '&#128570;', '&#128574;', '&#128575;', '&#128564;', '&#128573;', '&#128576;' };
	local members = DbData.mc("SELECT * FROM `accountes` WHERE `right`='"..right.."'");
	for i = 1,#members do
		rmsg:line(smiles[math.random(#smiles)].." "..NameSystem.GetR(members[i].vkid));
	end
end

command.exe = function (msg, args, other, rmsg)
	rmsg:line "• Список администрации •";
	rmsg:line ("Создатель: "..NameSystem.GetR(admin));
	rmsg:line ("Главный админ:");
	command.printlist(rmsg, 'mainadmin');
	rmsg:line ("Администрация:");
	command.printlist(rmsg, 'admin');
	rmsg:line ("Модерация:");
	command.printlist(rmsg, 'moderator');
end

return command;